In [19]:
import pandas as pd
df = pd.read_csv('adult_data.csv')
print(df['race'].value_counts())

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

In [20]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'education-num',
       'marital-status', 'occupation', 'relationship', 'race', 'sex',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'salary'],
      dtype='object')

In [99]:
df.head(7)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
5,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K

In [49]:
sex = df[df['sex'].str.contains('Male')]
print(sex['age'].mean())

39.43354749885268

In [79]:
print(df.query('age>=89')[['age', 'education', 'sex']])

       age     education     sex
222     90       HS-grad    Male
1040    90       HS-grad  Female
1935    90     Bachelors    Male
2303    90  Some-college    Male
2891    90  Some-college  Female
4070    90          11th    Male
4109    90     Bachelors  Female
5104    90  Some-college    Male
5272    90           9th  Female
5370    90       Masters    Male
5406    90       Masters    Male
6232    90     Bachelors    Male
6624    90          11th    Male
8806    90   Prof-school    Male
8963    90       HS-grad  Female
8973    90     Bachelors    Male
10210   90  Some-college    Male
10545   90       HS-grad    Male
11512   90       HS-grad  Female
11731   90       HS-grad    Male
11996   90     Bachelors    Male
12451   90  Some-college    Male
12975   90          10th    Male
14159   90    Assoc-acdm    Male
15356   90       HS-grad    Male
15892   90     Bachelors  Female
18277   90     Bachelors    Male
18413   90     Bachelors  Female
18725   90       HS-grad    Male
18832   90       Masters  Female
19212   90  Some-college  Female
19489   90       HS-grad    Male
19747   90       7th-8th    Male
20610   90       Masters  Female
22220   90     Bachelors    Male
24043   90       HS-grad    Male
24238   90       1st-4th  Female
25303   90       7th-8th  Female
28463   90       HS-grad    Male
31030   90       HS-grad    Male
31696   90       HS-grad    Male
32277   90       HS-grad  Female
32367   90       7th-8th    Male

In [90]:
education = df['education'].value_counts()
total = df['education'].count()
porcentaje = (5355 / total) * 100
print(porcentaje)

16.44605509658794

In [103]:
punto = df[['age', 'education', 'capital-gain']]
punto

       age   education  capital-gain
0       39   Bachelors          2174
1       50   Bachelors             0
2       38     HS-grad             0
3       53        11th             0
4       28   Bachelors             0
...    ...         ...           ...
32556   27  Assoc-acdm             0
32557   40     HS-grad             0
32558   58     HS-grad             0
32559   22     HS-grad             0
32560   52     HS-grad         15024

[32561 rows x 3 columns]

In [110]:
punto = punto[(punto['education'] == 'Bachelors') & (punto['capital-gain'] > 50000)]
punto

       age  education  capital-gain
1528    52  Bachelors         99999
1682    43  Bachelors         99999
1765    49  Bachelors         99999
2319    65  Bachelors         99999
6035    78  Bachelors         99999
7090    41  Bachelors         99999
7347    46  Bachelors         99999
8740    30  Bachelors         99999
9184    32  Bachelors         99999
9228    46  Bachelors         99999
10366   32  Bachelors         99999
10771   46  Bachelors         99999
11976   30  Bachelors         99999
13422   53  Bachelors         99999
13499   50  Bachelors         99999
14827   33  Bachelors         99999
15100   62  Bachelors         99999
15604   50  Bachelors         99999
16174   42  Bachelors         99999
18315   42  Bachelors         99999
19084   52  Bachelors         99999
19133   69  Bachelors         99999
19807   48  Bachelors         99999
19900   55  Bachelors         99999
21489   58  Bachelors         99999
21992   59  Bachelors         99999
22385   47  Bachelors         99999
22749   65  Bachelors         99999
23999   44  Bachelors         99999
24105   39  Bachelors         99999
24200   32  Bachelors         99999
24295   31  Bachelors         99999
24983   40  Bachelors         99999
25841   45  Bachelors         99999
26593   41  Bachelors         99999
27221   48  Bachelors         99999
27635   44  Bachelors         99999
28054   34  Bachelors         99999
28294   65  Bachelors         99999
29635   37  Bachelors         99999
32090   66  Bachelors         99999